In [2]:
import pandas as pd

df = pd.read_csv("../data/online_retail_sales.csv", encoding="utf-8")
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,01-12-2010 08:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,01-12-2010 08:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,01-12-2010 08:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,01-12-2010 08:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,01-12-2010 08:26,3.39,17850.0,United Kingdom

In [3]:
df.shape

(541909, 8)

In [4]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [6]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [7]:
#to check missing values
df.isna()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
541904,False,False,False,False,False,False,False,False
541905,False,False,False,False,False,False,False,False
541906,False,False,False,False,False,False,False,False
541907,False,False,False,False,False,False,False,False
541908,False,False,False,False,False,False,False,False

In [8]:
df.isna().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [9]:
df.isna().mean() * 100

InvoiceNo       0.000000
StockCode       0.000000
Description     0.268311
Quantity        0.000000
InvoiceDate     0.000000
UnitPrice       0.000000
CustomerID     24.926694
Country         0.000000
dtype: float64

In [1]:
df["Revenue"] = df["Quantity"] * df["UnitPrice"]

NameError: name 'df' is not defined

In [3]:
import pandas as pd

df = pd.read_csv("../data/online_retail_sales.csv")

In [4]:
df.shape

(541909, 8)

In [5]:
df["Revenue"] = df["Quantity"] * df["UnitPrice"]

In [6]:
df[["Quantity", "UnitPrice", "Revenue"]].head()

   Quantity  UnitPrice  Revenue
0         6       2.55    15.30
1         6       3.39    20.34
2         8       2.75    22.00
3         6       3.39    20.34
4         6       3.39    20.34

In [10]:
(df["Quantity"]<0).sum()

np.int64(10624)

In [11]:
df[df["Quantity"] < 0].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue
141,C536379,D,Discount,-1,01-12-2010 09:41,27.50,14527.0,United Kingdom,-27.50
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,01-12-2010 09:49,4.65,15311.0,United Kingdom,-4.65
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,01-12-2010 10:24,1.65,17548.0,United Kingdom,-19.80
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,01-12-2010 10:24,0.29,17548.0,United Kingdom,-6.96
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,01-12-2010 10:24,0.29,17548.0,United Kingdom,-6.96

In [12]:
df_sales = df[df["Quantity"] > 0]
df_cancellations = df[df["Quantity"] < 0]

In [13]:
df_sales.shape
df_cancellations.shape

(10624, 9)

In [14]:
df_sales.shape

(531285, 9)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
 8   Revenue      541909 non-null  float64
dtypes: float64(3), int64(1), object(5)
memory usage: 37.2+ MB

In [16]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Revenue'],
      dtype='object')

In [18]:
df_sales["InvoiceDate"] = pd.to_datetime(
    df_sales["InvoiceDate"],
    errors="coerce"
)

C:\Users\janan\AppData\Local\Temp\ipykernel_16444\2875849601.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sales["InvoiceDate"] = pd.to_datetime(

In [19]:
df_sales = df_sales.copy()

In [20]:
df_sales["InvoiceDate"] = pd.to_datetime(
    df_sales["InvoiceDate"],
    errors="coerce"
)

In [21]:
df_sales["InvoiceDate"].dtype

dtype('<M8[ns]')

In [22]:
df_sales["Month"] = df_sales["InvoiceDate"].dt.to_period("M")

In [23]:
df_sales[["InvoiceDate", "Month"]].head()

          InvoiceDate    Month
0 2010-01-12 08:26:00  2010-01
1 2010-01-12 08:26:00  2010-01
2 2010-01-12 08:26:00  2010-01
3 2010-01-12 08:26:00  2010-01
4 2010-01-12 08:26:00  2010-01

In [24]:
monthly_revenue = (
    df_sales
    .groupby("Month")["Revenue"]
    .sum()
    .reset_index()
)

In [25]:
monthly_revenue.head()

     Month   Revenue
0  2010-01  58960.79
1  2010-02  47748.38
2  2010-03  46943.71
3  2010-05  31774.95
4  2010-06  54830.46

In [26]:
df_sales["Month"].nunique()

22

In [27]:
monthly_revenue

      Month    Revenue
0   2010-01   58960.79
1   2010-02   47748.38
2   2010-03   46943.71
3   2010-05   31774.95
4   2010-06   54830.46
5   2010-07   99618.20
6   2010-08   45389.98
7   2010-09   53586.18
8   2010-10   59182.92
9   2010-12   17329.07
10  2011-01  262413.34
11  2011-02  256822.69
12  2011-03  283053.48
13  2011-04  385177.53
14  2011-05  381382.81
15  2011-06  342411.30
16  2011-07  433168.58
17  2011-08  351309.70
18  2011-09  466126.06
19  2011-10  339587.80
20  2011-11  411424.98
21  2011-12  222951.62

In [28]:
monthly_revenue["Month"].min(), monthly_revenue["Month"].max()

(Period('2010-01', 'M'), Period('2011-12', 'M'))

In [29]:
monthly_revenue.tail()

      Month    Revenue
17  2011-08  351309.70
18  2011-09  466126.06
19  2011-10  339587.80
20  2011-11  411424.98
21  2011-12  222951.62

In [30]:
country_revenue = (
    df_sales
    .groupby("Country")["Revenue"]
    .sum()
    .sort_values(ascending=False)
    .head(10)
)

In [31]:
country_revenue

Country
United Kingdom    9003097.964
Netherlands        285446.340
EIRE               283453.960
Germany            228867.140
France             209715.110
Australia          138521.310
Spain               61577.110
Switzerland         57089.900
Belgium             41196.340
Sweden              38378.330
Name: Revenue, dtype: float64

In [32]:
top_customers = (
    df_sales
    .groupby("CustomerID")["Revenue"]
    .sum()
    .sort_values(ascending=False)
    .head(10)
)

In [33]:
top_customers

CustomerID
14646.0    280206.02
18102.0    259657.30
17450.0    194550.79
16446.0    168472.50
14911.0    143825.06
12415.0    124914.53
14156.0    117379.63
17511.0     91062.38
16029.0     81024.84
12346.0     77183.60
Name: Revenue, dtype: float64

In [34]:
top_customer_revenue = top_customers.iloc[0]
total_revenue = df_sales["Revenue"].sum()

(top_customer_revenue / total_revenue) * 100

np.float64(2.6323869548264964)